app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "phone", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sunil"], ["phone", "8056162521"], ["email", "sunilkalyan08@gmail.com"], ["created_at", "2015-07-30 10:26:27.078966"], ["updated_at", "2015-07-30 10:26:27.078966"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save